<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="image" type="Parameter" version="opset1">
			<data shape="1,3,1024,1024" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="image">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="/Constant_408" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_408_output_0" />
			</output>
		</layer>
		<layer id="2" name="/Constant_275" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_275_output_0" />
			</output>
		</layer>
		<layer id="3" name="/Constant_24" type="Const" version="opset1">
			<data element_type="f32" shape="1, 3, 4" offset="8" size="48" />
			<output>
				<port id="0" precision="FP32" names="/Constant_24_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/Constant_11_output_0" />
			</output>
		</layer>
		<layer id="5" name="/backbone/init_block/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="56" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="6" name="ShapeOf_210199" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_210200" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Constant_210201" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="9" name="Gather_210202" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/init_block/Gather_output_0" />
			</output>
		</layer>
		<layer id="10" name="/backbone/init_block/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Sub_output_0" />
			</output>
		</layer>
		<layer id="11" name="/backbone/init_block/Constant_6" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_6_output_0" />
			</output>
		</layer>
		<layer id="12" name="/backbone/init_block/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Cast_1_output_0,/backbone/init_block/Cast_output_0,/backbone/init_block/Div_output_0" />
			</output>
		</layer>
		<layer id="13" name="Constant_210204" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Reshape_210205" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Unsqueeze_4_output_0,/backbone/init_block/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="/backbone/init_block/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="16" name="Constant_210305" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_210306" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Unsqueeze_1_output_0,/backbone/init_block/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="/backbone/init_block/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="56" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="19" name="Constant_210471" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="80" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="20" name="Constant_210472" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="21" name="Gather_210473" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/init_block/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="22" name="/backbone/init_block/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="23" name="/backbone/init_block/Constant_7" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_7_output_0" />
			</output>
		</layer>
		<layer id="24" name="/backbone/init_block/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Cast_2_output_0,/backbone/init_block/Cast_3_output_0,/backbone/init_block/Div_1_output_0" />
			</output>
		</layer>
		<layer id="25" name="Constant_210475" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Reshape_210476" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Unsqueeze_2_output_0,/backbone/init_block/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/init_block/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="28" name="Constant_210576" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Reshape_210577" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Unsqueeze_3_output_0,/backbone/init_block/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/init_block/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/backbone/init_block/Cast_4_output_0,/backbone/init_block/Concat_1_output_0,/backbone/init_block/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="/backbone/init_block/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="88" size="32" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="/backbone/init_block/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/init_block/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="120" size="16" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_10_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/init_block/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="/backbone/init_block/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="/backbone/init_block/Constant_13" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="144" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_13_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/init_block/Constant_14" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_14_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="/backbone/init_block/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/init_block/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="/backbone/init_block/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/backbone/init_block/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_120901" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="152" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="/backbone/init_block/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_143671" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/init_block/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/init_block/Cast_5_output_0,/backbone/init_block/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_120908" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="45" name="Split_120909" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_120907" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="168" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="47" name="/backbone/init_block/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/backbone/init_block/Pad_output_0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="onnx::Conv_3771" type="Const" version="opset1">
			<data element_type="f32" shape="32, 3, 3, 3" offset="172" size="3456" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_3771">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="/backbone/init_block/conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1025</dim>
					<dim>1025</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Reshape_121026" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="3628" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/init_block/conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/init_block/conv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="/backbone/init_block/conv/activ/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/init_block/conv/activ/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="/backbone/stage1/unit1/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3756" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="54" name="ShapeOf_210741" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_210742" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="56" name="Constant_210743" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="Gather_210744" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stage1/unit1/Gather_output_0" />
			</output>
		</layer>
		<layer id="58" name="/backbone/stage1/unit1/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Sub_output_0" />
			</output>
		</layer>
		<layer id="59" name="/backbone/stage1/unit1/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="60" name="/backbone/stage1/unit1/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Cast_1_output_0,/backbone/stage1/unit1/Cast_output_0,/backbone/stage1/unit1/Div_output_0" />
			</output>
		</layer>
		<layer id="61" name="Constant_210746" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Reshape_210747" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Unsqueeze_4_output_0,/backbone/stage1/unit1/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/stage1/unit1/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="64" name="Constant_210847" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_210848" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Unsqueeze_1_output_0,/backbone/stage1/unit1/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/stage1/unit1/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3756" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="67" name="Constant_211013" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="80" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="68" name="Constant_211014" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="69" name="Gather_211015" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stage1/unit1/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="70" name="/backbone/stage1/unit1/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="71" name="/backbone/stage1/unit1/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="72" name="/backbone/stage1/unit1/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Cast_2_output_0,/backbone/stage1/unit1/Cast_3_output_0,/backbone/stage1/unit1/Div_1_output_0" />
			</output>
		</layer>
		<layer id="73" name="Constant_211017" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_211018" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Unsqueeze_2_output_0,/backbone/stage1/unit1/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/stage1/unit1/Sub_3" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Sub_3_output_0" />
			</output>
		</layer>
		<layer id="76" name="Constant_211118" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_211119" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Unsqueeze_3_output_0,/backbone/stage1/unit1/Unsqueeze_7_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="/backbone/stage1/unit1/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="/backbone/stage1/unit1/Cast_4_output_0,/backbone/stage1/unit1/Concat_1_output_0,/backbone/stage1/unit1/Concat_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/stage1/unit1/ConstantOfShape" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="88" size="32" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/ConstantOfShape_output_0">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="/backbone/stage1/unit1/Concat_2" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Concat_2_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="/backbone/stage1/unit1/Constant_8" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="120" size="16" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_8_output_0">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/stage1/unit1/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Reshape_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/stage1/unit1/Constant_10" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_10_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="/backbone/stage1/unit1/Constant_11" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="144" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_11_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="/backbone/stage1/unit1/Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_12_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/stage1/unit1/Constant_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit1/Constant_9_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="/backbone/stage1/unit1/Slice" type="Slice" version="opset8">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
				<port id="4" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="I64" names="/backbone/stage1/unit1/Slice_output_0">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_121093" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="152" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/stage1/unit1/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Transpose_output_0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_143672" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="136" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="/backbone/stage1/unit1/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit1/Cast_5_output_0,/backbone/stage1/unit1/Reshape_1_output_0">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_121100" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="93" name="Split_121101" type="Split" version="opset1">
			<data num_splits="2" />
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_121099" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="168" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="95" name="/backbone/stage1/unit1/Pad" type="Pad" version="opset12">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="/backbone/stage1/unit1/Pad_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>514</dim>
					<dim>514</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Reshape_121213" type="Const" version="opset1">
			<data element_type="f32" shape="32, 1, 1, 3, 3" offset="3764" size="1152" />
			<output>
				<port id="0" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="/backbone/stage1/unit1/dw_conv/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="0, 0" pads_end="0, 0" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>514</dim>
					<dim>514</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Reshape_121265" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="4916" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/stage1/unit1/dw_conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/dw_conv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="/backbone/stage1/unit1/dw_conv/activ/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/dw_conv/activ/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Range_121277" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="5044" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/stage1/unit1/se/pool/GlobalAveragePool" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/se/pool/GlobalAveragePool_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="model.backbone.features.stage1.unit1.se.conv1.weight" type="Const" version="opset1">
			<data element_type="f32" shape="8, 32, 1, 1" offset="5060" size="1024" />
			<output>
				<port id="0" precision="FP32" names="model.backbone.features.stage1.unit1.se.conv1.weight">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/backbone/stage1/unit1/se/conv1/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Reshape_121295" type="Const" version="opset1">
			<data element_type="f32" shape="1, 8, 1, 1" offset="6084" size="32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="/backbone/stage1/unit1/se/conv1/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/se/conv1/Conv_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="/backbone/stage1/unit1/se/activ/Mul" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/se/activ/Mul_output_0">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="model.backbone.features.stage1.unit1.se.conv2.weight" type="Const" version="opset1">
			<data element_type="f32" shape="32, 8, 1, 1" offset="6116" size="1024" />
			<output>
				<port id="0" precision="FP32" names="model.backbone.features.stage1.unit1.se.conv2.weight">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="/backbone/stage1/unit1/se/conv2/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Reshape_121313" type="Const" version="opset1">
			<data element_type="f32" shape="1, 32, 1, 1" offset="7140" size="128" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="/backbone/stage1/unit1/se/conv2/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/se/conv2/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="/backbone/stage1/unit1/se/sigmoid/Sigmoid" type="Sigmoid" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stage1/unit1/se/sigmoid/Sigmoid_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="/backbone/stage1/unit1/se/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/se/Mul_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="onnx::Conv_3777" type="Const" version="opset1">
			<data element_type="f32" shape="16, 32, 1, 1" offset="7268" size="2048" />
			<output>
				<port id="0" precision="FP32" names="onnx::Conv_3777">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="/backbone/stage1/unit1/pw_conv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Reshape_121331" type="Const" version="opset1">
			<data element_type="f32" shape="1, 16, 1, 1" offset="9316" size="64" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="/backbone/stage1/unit1/pw_conv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stage1/unit1/pw_conv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="/backbone/stage1/unit2/Constant_2" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3756" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit2/Constant_2_output_0" />
			</output>
		</layer>
		<layer id="119" name="ShapeOf_211283" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>512</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Constant_211284" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="121" name="Constant_211285" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="122" name="Gather_211286" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stage1/unit2/Gather_output_0" />
			</output>
		</layer>
		<layer id="123" name="/backbone/stage1/unit2/Sub" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Sub_output_0" />
			</output>
		</layer>
		<layer id="124" name="/backbone/stage1/unit2/Constant_4" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit2/Constant_4_output_0" />
			</output>
		</layer>
		<layer id="125" name="/backbone/stage1/unit2/Div" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Cast_1_output_0,/backbone/stage1/unit2/Cast_output_0,/backbone/stage1/unit2/Div_output_0" />
			</output>
		</layer>
		<layer id="126" name="Constant_211288" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="Reshape_211289" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Unsqueeze_4_output_0,/backbone/stage1/unit2/Unsqueeze_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="/backbone/stage1/unit2/Sub_2" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Sub_2_output_0" />
			</output>
		</layer>
		<layer id="129" name="Constant_211389" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Reshape_211390" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Unsqueeze_1_output_0,/backbone/stage1/unit2/Unsqueeze_5_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="/backbone/stage1/unit2/Constant_3" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="3756" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit2/Constant_3_output_0" />
			</output>
		</layer>
		<layer id="132" name="Constant_211555" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="80" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="133" name="Constant_211556" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="0" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="134" name="Gather_211557" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="/backbone/stage1/unit2/Gather_1_output_0" />
			</output>
		</layer>
		<layer id="135" name="/backbone/stage1/unit2/Sub_1" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Sub_1_output_0" />
			</output>
		</layer>
		<layer id="136" name="/backbone/stage1/unit2/Constant_5" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="64" size="8" />
			<output>
				<port id="0" precision="I64" names="/backbone/stage1/unit2/Constant_5_output_0" />
			</output>
		</layer>
		<layer id="137" name="/backbone/stage1/unit2/Div_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Cast_2_output_0,/backbone/stage1/unit2/Cast_3_output_0,/backbone/stage1/unit2/Div_1_output_0" />
			</output>
		</layer>
		<layer id="138" name="Constant_211559" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="72" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="Reshape_211560" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="/backbone/stage1/unit2/Unsqueeze_2_output_0,/backbone/stage1/unit2/Unsqueeze_6_output_0">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="/backbone/stage1/unit2/Sub_3" type="Subtract" version="opset1">
